Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Returns name of the currently selected item in a ListBox or ComboBox
fr: Retourne le nom de l'élément sélectionné dans un contrôle type ListBox ou ComboBox

source: Returns # of lines in an Edit
fr: Retourne le nombre de lignes dans un contrôle type Edit

source: Returns text at line # passed of an Edit
fr: Retourne le texte d'une ligne d'un contrôle de type Edit

source: Returns selected text of an Edit
fr: Retourne le texte sélectionné d'un contrôle de type Edit

source: Pastes the 'string' at the Edit's caret position
fr: Ajoute la chaine 'string' à la position du curseur dans un contrôle de type Edit

source: Returns the current Tab shown of a SysTabControl32
fr: Retourne l'onglet sélectionné dans un contrôle type SysTabControl32

source: Moves to the next tab to the right of a SysTabControl32
fr: Passe à l'onglet suivant vers la droite dans un contrôle type SysTabControl32

source: Moves to the next tab to the left of a SysTabControl32
fr: Passe à l'onglet suivant vers la gauche dans un contrôle type SysTabControl32

source: Simulates the WM_COMMAND message.
fr: Simule l'envoi du message WM_COMMAND.

source: Usually used for ToolbarWindow32 controls - use the ToolBar tab of Au3Info to get the Command ID.
fr: Habituellement utilisé pour les contrôles type ToolbarWindow32 - Utilisez l'onglet 'ToolBar' de Au3Info pour avoir l'ID d'une commande.

source: Some controls will resist automation unless they are the active window.
fr: Certains contrôles peuvent résister à l'automation tant qu'ils ne sont pas dans la fenêtre active.

source: Use the WinActivate() function to force the control's window to the top before using ControlCommand() on these controls.
fr: Utilisez la fonction WinActivate() pour mettre la fenêtre des contrôles au premier plan avant d'utiliser ControlCommand().

source: Certain commands that work on normal Combo and ListBoxes do not work on "ComboLBox" controls.
fr: Certaines commandes fonctionnant pour un contrôle type ComboBox ou ListBox, peuvent ne pas fonctionner pour des contrôles type "ComboLBox".

source: Send a command to the edit control of Notepad to find the number of lines.
fr: Envoie une commande au contrôle d'édition de Bloc-notes pour trouver le nombre de lignes.

source: The handle returned by WinWait is used for the "title" parameter of ControlCommand.
fr: Le handle renvoyé par WinWait est utilisé pour le paramètre \"titre\" de ControlCommand.

source: Display the number of lines.
fr: Affiche le nombre de lignes.

source: Disables or "grays-out" a control.
fr: Désactive ou met en grisé un contrôle.

source: Disable the edit control of Notepad using the handle returned by WinWait.
fr: Désactive le contrôle d'édition du Bloc-notes à l'aide du handle renvoyé par WinWait.

source: Enable the edit control of Notepad using the handle returned by WinWait.
fr: Active le contrôle d'édition du Bloc-notes à l'aide du handle renvoyé par WinWait.

source: Enables a "grayed-out" control.
fr: Active ou dégrise un contrôle.

source: Sets input focus to a given control on a window.
fr: Donne le focus à un contrôle.

source: Set input focus to the edit control of Notepad using the handle returned by WinWait.
fr: Définit le focus sur le contrôle d'édition du Bloc-notes à l'aide du handle renvoyé par WinWait.

source: Returns the ControlRef# of the control that has keyboard focus within a specified window.
fr: Retourne la référence du contrôle qui a le focus clavier dans une fenêtre donnée.

source: the ClassNameNN of the control that has keyboard focus within a specified window.
fr: Retourne la référence ClassNameNN du contrôle qui a le focus clavier dans la fenêtre donnée.

source: "" (empty string) and sets the @error flag to 1 if window is not found.
fr: Retourne "" (chaine vide) et @error = 1 si la fenêtre est introuvable.

source: Retrieve the control that has keyboard focus in Notepad.
fr: Récupére le contrôle qui a le focus clavier dans le Bloc-notes.

source: The handle returned by WinWait is used for the "title" parameter of ControlGetFocus.
fr: Le handle renvoyé par WinWait est utilisé pour le paramètre \"titre\" de ControlGetFocus.

source: Display the control that has keyboard focus.
fr: Affiche le contrôle qui a le focus clavier.

source: Retrieves the internal handle of a control.
fr: Retourne le handle d'un contrôle.

source: the handle (HWND) value.
fr: Retourne la référence interne au contrôle (handle).

source: 0 and sets the @error flag to non-zero if no window matches the criteria.
fr: Retourne "" (chaine vide) et @error = 1 si aucune fenêtre correspondant au critère n'est trouvée.

source: This function returns a HWND/Handle value.
fr: Cette fonction retourne une valeur de type HWND/Handle.

source: Retrieve the handle of the edit control in Notepad.
fr: Récupére Le handle du contrôled'é dition du Bloc-notes.

source: The handle returned by WinWait is used for the "title" parameter of ControlGetHandle.
fr: Le handle renvoyé par WinWait est utilisé pour le paramètre \"titre\" de ControlGetHandle.

source: Display the handle of the edit control.
fr: Affiche Le handle du contrôle d'édition.

source: Retrieves the position and size of a control relative to its window.
fr: Retourne la position et la taille d'un contrôle.

source: an array containing the size and the control's position relative to its client window:
fr: Retourne un tableau contenant la taille et la position du contrôle relatif à la partie cliente de la fenêtre :

source: $aArray[0] = X position
fr: $array[0] = Abscisse

source: $aArray[1] = Y position
fr: $array[1] = Ordonnée

source: $aArray[2] = Width
fr: $array[2] = Largeur

source: $aArray[3] = Height
fr: $array[3] = Hauteur

source: sets the @error flag to 1.
fr: Retourne @error = 1.

source: The title/text is referencing the parent window, so be careful with "","" which references the active window which may not be the one containing the controlID control.
fr: Le titre et le texte font référence à la fenêtre parente, donc faites attention avec "","" qui référence la fenêtre active qui n'est peut être pas celle qui contient le controlID du contrôle.

source: Retrieve the position x, y and size (width and height) of the edit control in Notepad.
fr: Récupére la position x, y et la taille (largeur et hauteur) du contrôle d'édition du Bloc-notes.

source: The handle returned by WinWait is used for the "title" parameter of ControlGetPos.
fr: Le handle renvoyé par WinWait est utilisé pour le paramètre \"titre\" de ControlGetPos.

source: Display the position and size of the edit control.
fr: Affiche la position et la taille du champ de saisie.

source: Retrieves text from a control.
fr: Retourne le texte d'un contrôle.

source: the text from a control.
fr: Retourne le texte d'un contrôle (contenu, label).

source: "" (empty string) and sets the @error flag to 1.
fr: Retourne "" (chaine vide) et @error = 1 si la fenêtre ou le contrôle est introuvable.

source: Set the edit control in Notepad with some text.
fr: Définit le texte du contrôle d'édition du Bloc-notes.

source: The handle returned by WinWait is used for the "title" parameter of ControlSetText.
fr: Le handle renvoyé par WinWait est utilisé pour le paramètre \"titre\" de ControlSetText.

source: Retrieve the text of the edit control in Notepad.
fr: Récupére le texte du contrôle d'édition du Bloc-notes.

source: The handle returned by WinWait is used for the "title" parameter of ControlGetText.
fr: Le handle renvoyé par WinWait est utilisé pour le paramètre \"titre\" de ControlGetText.

source: Display the text of the edit control.
fr: Affiche le texte du contrôle d'édition.

source: Hides a control.
fr: Cache un contrôle.

source: 0 if window/control is not found.
fr: Retourne 0 si la fenêtre ou le contrôle est introuvable.

source: Hide the edit control of Notepad using the handle returned by WinWait.
fr: Cache le contrôle d'édition du Bloc-notes à l'aide du handle renvoyé par WinWait.

source: Show the edit control of Notepad using the handle returned by WinWait.
fr: Affiche le contrôle d'édition du Bloc-notes à l'aide du handle renvoyé par WinWait.

source: Sends a command to a ListView32 control.
fr: Envoie une commande à un contrôle ListView32.

source: The command to send to the control (see below).
fr: La commande à envoyer au contrôle (Consultezci-dessous).

source: In case of an error (such as an invalid command or window/control could not be found) then @error is set to 1.
fr: En cas d'erreur (telle qu'une commande ou fenêtre/contrôle invalide), @error est mis à 1.

source: Deselects one or more items.
fr: Dé-sélectionne un ou plusieurs éléments.

source: Returns the item index of the string.
fr: Retourne l'index de la chaîne recherchée.

source: Returns -1 if the string is not found.
fr: Retourne -1 si la chaîne n'est pas trouvée.

source: Returns the number of list items.
fr: Retourne le nombre d'éléments de la liste.

source: Returns a string containing the item index of selected items.
fr: Retourne une chaîne contenant l'index des éléments sélectionnés.

source: If option=0 (default) only the first selected item is returned.
fr: Si option=0 (défaut) seul l'index du premier élément sélectionné est retourné.

source: If option=1 then all the selected items are returned delimited by |, e.g:
fr: Si option=1 alors tout les index sélectionnés sont retournés séparés par le caractère "|", par exemple:

source: If no items are selected a blank "" string is returned.
fr: Si aucun éléments n'est sélectionné, une chaine vide "" est retournée.

source: Returns the number of items that are selected.
fr: Retourne le nombre d'éléments qui sont sélectionnés.

source: Returns the number of subitems.
fr: Retourne le nombre de sous-éléments.

source: Returns the text of a given item/subitem.
fr: Retourne le texte d'un élément/sous élément donné.

source: Returns 1 if the item is selected, otherwise returns 0.
fr: Retourne 1 si l'élément est sélectionné, sinon retourne 0.

source: Selects one or more items.
fr: Sélectionne un ou plusieurs éléments.

source: Selects all items.
fr: Sélectionne tous les éléments.

source: Clears the selection of all items.
fr: Efface la sélection de tous les éléments.

source: Inverts the current selection.
fr: Inverse la sélection en cours.

source: Changes the current view.
fr: Change le type de vue en cours.

source: Valid views are "list", "details", "smallicons", "largeicons".
fr: Les types de vues possibles sont :"list", "details", "smallicons", "largeicons".

source: All items/subitems are 0 based.
fr: Tous les éléments et sous éléments sont indexés à partir de 0.

source: This means that the first item/subitem in a list is 0, the second is 1, and so on.
fr: Cela signifie que le premier élément de la liste a pour indice 0, le second a pour indice 1, et ainsi de suite.

source: In a "Details" view of a ListView32 control, the "item" can be thought of as the "row" and the "subitem" as the "column".
fr: Dans une vue "détaillée" d'un contrôle de type ListView32, un élément ("item") correspond à une ligne ("row") et un sous-élément ("subitem") à une colonne ("column").

source: Some commands may fail when using a 32-bit AutoIt process to read from a 64-bit process.
fr: Certaines commandes peuvent échouer lors de l'utilisation d'un processus AutoIt 32-Bits pour lire un processus 64-bits.

source: Likewise commands may fail when using a 64-bit AutoIt process to read from a 32-bit process.
fr: De même des commandes peuvent échouer lors de l'utilisation d'un processus AutoIt 64-Bits pour lire un processus 32-bits.

source: Moves a control within a window.
fr: Déplace un contrôle dans une fenêtre.

source: X coordinate to move to relative to the window client area.
fr: La coordonnée x de la nouvelle position du contrôle, relatif à la zone cliente de la fenêtre.

source: Y coordinate to move to relative to the window client area.
fr: La coordonnée y de la nouvelle position du contrôle, relatif à la zone cliente de la fenêtre.

source: New width of the window.
fr: Nouvelle largeur du contrôle.

source: New height of the window.
fr: Nouvelle hauteur du contrôle.

source: If x and y equal to the Default keyword no move occurs, just resizing.
fr: Si x et y sont égaux à Default, le contrôle est redimensionné sans être déplacé.

source: Move the edit control of Notepad using the handle returned by WinWait.
fr: Déplace le contrôle d'édition du Bloc-notes à l'aide du handle renvoyé par WinWait.

source: Controls functions Reference
fr: Controls - Référence Fonctions

source: Below is a complete list of the functions available in AutoIt.
fr: Voici une liste complète des fonctions disponibles dans AutoIt.

source: Click on a function name for a detailed description.
fr: Cliquez sur le nom d'une fonction pour une description détaillée.

source: Function
fr: Fonction

source: Sends a string of characters to a control.
fr: Envoie une chaîne de caractère à un contrôle.

source: Sets text of a control.
fr: Modifie le texte d'un contrôle.

source: Shows a control that was hidden.
fr: Affiche un contrôle précédemment caché.

source: Sends a command to a TreeView32 control.
fr: Envoie une commande à un contrôle TreeView32.

source: Retrieves the text from a standard status bar control.
fr: Récupère le texte d'un contrôle de barre d'état standard.

source: String of characters to send to the control.
fr: Chaîne de caractères à envoyer au contrôle.

source: Changes how "keys" is processed:
fr: Change la manière de traiter les "touches" :

source: 0 = (default) Text contains special characters like + to indicate SHIFT and {LEFT} to indicate left arrow.
fr: 0 = (défaut) Texte contenant des caractères spéciaux tel que + pour indiquer SHIFT et {LEFT} pour indiquer la flèche gauche.

source: 1 = keys are sent raw.
fr: 1 = les touches sont envoyées en mode raw (tel quel).

source: ControlSend() works in a similar way to Send() but it can send key strokes directly to a window/control, rather than just to the active window.
fr: ControlSend() fonctionne de manière similaire à Send, mais il peut envoyer des appuis de touche directement à une fenêtre ou un contrôle, au lieu de la fenêtre active seulement.

source: ControlSend() is only unreliable for command prompts as that works differently to normal windows (seems to check physical states rather than accepting the keystroke messages).
fr: ControlSend() est instable pour les fenêtres de commande (DOS) car elles fonctionnent différemment d'une fenêtre normale (Semble vérifier l'état physique plutôt qu'accepter les messages de frappe clavier).

source: For normal windows ControlSend() should be way more reliable than a normal Send() - and yes it does send shift, ctrl, alt etc.
fr: Pour une fenêtre normale, ControlSend() devrait être plus fiable, qu'un Send() normal.Et oui, il envoie Shift, Ctrl, Alt etc.

source: As mention in the Send() help the keyboard that send different chars when in CAPS LOCK and using the Shift Key cannot be simulated.An example is the Czech Keyboard.
fr: Comme il est mentionné dans l'aide de Send(), un clavier qui envoie des caractères différents lorsque CAPS LOCK et la touche Shift sont utilisée ne peut être simulé (le clavier Tchèque par exemple).

source: A good workaround is to use the ControlSetText().
fr: Une bonne manière de contourner le problème, est d'utiliser ControlSetText().

source: The control might first need to be given focus with the ControlFocus() command, specially when referencing an controlID created by the script itself.
fr: Le contrôle peut en premier avoir besoin du focus avec la commande ControlFocus(), spécialement lorsqu'il se réfère à un controlID créer par le script lui même.

source: Opt("SendKeyDelay",...) alters the length of the brief pause in between sent keystrokes.
fr: Opt("SendKeyDelay",...)modifie la durée de la pause entre les envois de touches.

source: Opt("SendKeyDownDelay",...) alters the length of time a key is held down before being released during a keystroke.
fr: Opt("SendKeyDownDelay",...)modifie la durée de maintien d'une touche avant qu'elle ne soit relâchée pendant une frappe clavier.

source: Send a string of text to the edit control of Notepad.
fr: Envoie une chaîne de texte au contrôle d'édition du Bloc-notes.

source: The new text to be set into the control.
fr: Le nouveau texte à affecter au contrôle.

source: when different from 0 (default) will force the target window to be redrawn.
fr: Si ce paramètre est différent de 0 (défaut), la fenêtre sera rafraichie de force.

source: Return depends on the command as table below shows.
fr: Dépend de la commande comme le montre le tableau ci-dessous.

source: Operation
fr: Opération

source: Checks an item (if the item supports it).
fr: Coche un élément (si celui-ci le permet).

source: Collapses an item to hide its children.
fr: Replie un élément pour cacher ses sous-éléments.

source: Returns 1 if an item exists, otherwise 0.
fr: Retourne 1 si un élément existe, sinon 0.

source: Expands an item to show its children.
fr: Déploie un élément pour montrer ses sous-éléments.

source: Returns the number of children for a selected item.
fr: Retourne le nombre de sous-éléments pour un élément sélectionné.

source: Returns the item reference of the current selection using the text reference of the item (or index reference if UseIndex is set to 1).
fr: Retourne la référence de l'élément de la sélection en cours, par la référence de son texte (ou par son index si UseIndex est mis à 1).

source: Returns the text of an item.
fr: Retourne le texte d'un élément.

source: Returns the state of an item.
fr: Retourne l'état d'un élément.

source: 1:checked, 0:unchecked, -1:not a checkbox.
fr: 1:coché, 0:décoché, -1:n'est pas de type CheckBox.

source: Selects an item.
fr: Sélectionne un élément.

source: Unchecks an item (if the item supports it).
fr: Décoche un élément (si celui-ci le permet).

source: The "item" parameter is a string-based parameter that is used to reference a particular treeview item using a combination of text and indices.
fr: Le paramètre "item" est un paramètre basée sur une chaîne qui est utilisé pour référencer un élément spécifique du 'treevieww' par une combinaison de texte et d'indices.

source: Indices are 0-based.
fr: Les indices sont indexés à partir de 0.

source: For example:
fr: Par exemple:

source: Each "level" is separated by |.
fr: Chaque "niveau" est séparé par le caractère "|".

source: An index is preceded with #.
fr: Et chaque index est précédé du caractère "#".

source: Examples:
fr: Exemples:

source: Item
fr: Elément

source: Item Reference
fr: Référence d'élément

source: "Heading2" or "#1"
fr: "Heading2" ou "#1"

source: "Heading1|H1SubItem2" or "#0|#1"
fr: "Heading1|H1SubItem2" ou "#0|#1"

source: "Heading1|H1SubItem3|H1S1SubItem1" or "#0|#2|#0"
fr: "Heading1|H1SubItem3|H1S1SubItem1" ou "#0|#2|#0"

source: References can also be mixed like "Heading1|#1".
fr: Les références peuvent aussi être mixées tel que "Heading1|#1".

source: As AutoIt is a 32-bit application some commands are not available when referencing a 64-bit application as Explorer when running on 64-bit Windows.
fr: Comme AutoIt est une application 32-bit, quelques commandes ne sont pas disponibles pour référencer une application 64-bit comme Explorer lors de l'exécution sur un Windows 64-bit.

source: Calculates the cosine of a number.
fr: Calcule le cosinus d'un nombre.

source: Value in radians.
fr: Valeur en radians.

source: Returns the trigonometric cosine of the number.
fr: Retourne le cosinus trigonométrique d'un nombre.

source: Assign a Local variable the cosine of PI / 4 (equals to Sqrt(2) / 2).
fr: Assigne une variable locale avec le cosinus de PI / 4 (égal à sqrt (2) / 2).

source: Assign a Local variable the formula to switch from radian to degree (equals to one degree in radian).
fr: Assigne une variable locale avec le facteur de conversion de radian en degré (égal à un degré en radian).

source: Assign a Local variable the cosine of 90 degrees (firstly converted to radians).
fr: Assigne une variable locale avec le cosinus de 90 degrés (d'abord converti en radians).

source: Crypt user defined functions Reference
fr: Crypt - Référence

source: When using them you need to add a #include <Crypt.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Crypt.au3>.

source: Date user defined functions Reference
fr: Date - Référence

source: When using them you need to add a #include <Date.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Date.au3>.

source: Debug user defined functions Reference
fr: Debug - Référence

source: When using them you need to add a #include <Debug.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Debug.au3>.

source: Returns a numeric representation of a hexadecimal string.
fr: Retourne une représentation numérique d'une chaîne hexadécimale.

source: The hexadecimal string to convert.
fr: La chaîne hexadécimale à convertir.

source: [optional]Defines behavior.
fr: [optional] Définit la conversion.

source: Default = string is interpreted as an integer.
fr: Défaut = chaîne interprétée comme un entier.

source: 1 = string is interpreted as a 32bit integer
fr: 1 = chaîne interprétée comme un entier 32bit

source: 2 = string is interpreted as a 64bit integer
fr: 2 = chaîne interprétée comme un entier 64bit

source: 3 = string is interpreted as a double
fr: 3 = chaîne interprétée comme un 'double'

source: the required data.
fr: Retourne un nombre entier.

source: 0 and sets the @error flag to 1 if an invalid hex string was used or if an overflow occurs.
fr: Retourne 0 et @error = 1 si une chaîne hexadécimale invalide a été utilisée, ou si un débordement a lieu.

source: Default behavior is that the input string is treated as an integer.In this case, if the result is within range of a 32bit integer then it's returned as a 32bit integer, otherwise it's returned as a 64bit integer - both signed.
fr: La fonction ne fonctionne qu'avec les nombres correspondant à un entier signé de 32 bits (-2147483648 à 2147483647)

source: Displays the number 4095.
fr: Affiche le nombre 4095.

source: Copies a directory and all sub-directories and files (Similar to xcopy).
fr: Copie un répertoire et tous ses sous-répertoires et fichiers (similaire à XCopy).

source: Path of the source directory (with no trailing backslash).
fr: Chemin du répertoire source (sans antislash final).

source: e.g.
fr: Ex.:

source: "C:\Path1"
fr: "C:\Chemin1"

source: Path of the destination dir (with no trailing backslash).
fr: Chemin du répertoire de destination (sans antislash final).

source: "C:\Path_Copy"
fr: "C:\Chemin_copie"

source: this flag determines whether to overwrite files if they already exist:
fr: Ce paramètre détermine si vous voulez remplacer les fichiers existants:

source: $FC_NOOVERWRITE (0) = (default) do not overwrite existing files
fr: $FC_NOOVERWRITE (0) = (défaut) Ne remplace pas les fichiers existants

source: $FC_OVERWRITE (1) = overwrite existing files
fr: $FC_OVERWRITE (1) = Remplace les fichiers existants

source: Constants are defined in FileConstants.au3
fr: Les constantes sont définies dans FileConstants.au3

source: 0 if there is an error copying the directory.
fr: Retourne 0 en cas d'erreur durant la copie du répertoire.

source: If the destination directory structure doesn't exist, it will be created (if possible).
fr: Si la structure du répertoire de destination n'existe pas, elle sera créée (si cela est possible).

source: Creates a directory/folder.
fr: Créé un répertoire/dossier.

source: Path of the directory to create.
fr: Chemin du répertoire que l'on veut créer.

source: 0 if there was an error creating the directory.
fr: Retourne 0 s'il y a eu une erreur lors de la création du répertoire.
